## 1. 파이썬 튜토리얼

### 함수

In [5]:
# def == define; 특정 함수 정의
def multiply(a, b):
    c = a * b
    return c

print(multiply(2,3))
print(multiply(4,5))

6
20

In [7]:
def sign(n):
    if n > 0:
        return "양수"
    elif n < 0:
        return "음수"
    else:
        return "0"

for n in [-1, 0, 1]:
    print(sign(n))

음수
0
양수

### 팩토리얼 함수 만들기

In [8]:
def fact(n):
    # 결과값의 초기값 1 할당
    result = 1
    
    for i in range(1,n+1):
        result = result * i
        
    return result

print (fact(3))
print (fact(7))

6
5040

In [1]:
import pandas as pd

## 2. DSschool #2에서 Titanic model을 통해 실습한 내용을 바탕으로 Bike sharing demand에 pandas library를 적용해 본다.

### 2-1. Train, Test data를 import한다.

In [9]:
train = pd.read_csv("train.csv")

print (train.shape)
train.head()

(10886, 12)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [10]:
test = pd.read_csv("test.csv")

print (test.shape)
test.head()

(6493, 9)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed
0,2011-01-20 00:00:00,1,0,1,1,10.66,11.365,56,26.0027
1,2011-01-20 01:00:00,1,0,1,1,10.66,13.635,56,0.0000
2,2011-01-20 02:00:00,1,0,1,1,10.66,13.635,56,0.0000
3,2011-01-20 03:00:00,1,0,1,1,10.66,12.880,56,11.0014
4,2011-01-20 04:00:00,1,0,1,1,10.66,12.880,56,11.0014

In [12]:
train.index

RangeIndex(start=0, stop=10886, step=1)

In [13]:
test.index

RangeIndex(start=0, stop=6493, step=1)

In [16]:
# column 가져오기

train.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

### 2-2. 행렬

행렬 가져오기의 기본

행(column) 가져오기

In [18]:
train["count"].head()

0    16
1    40
2    32
3    13
4     1
Name: count, dtype: int64

In [19]:
train[["casual", "registered", "count"]].head()

   casual  registered  count
0       3          13     16
1       8          32     40
2       5          27     32
3       3          10     13
4       0           1      1

열(row) 가져오기

In [20]:
train.loc[1]

datetime      2011-01-01 01:00:00
season                          1
holiday                         0
workingday                      0
weather                         1
temp                         9.02
atemp                      13.635
humidity                       80
windspeed                       0
casual                          8
registered                     32
count                          40
Name: 1, dtype: object

In [21]:
train.loc[1:7]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
5,2011-01-01 05:00:00,1,0,0,2,9.84,12.880,75,6.0032,0,1,1
6,2011-01-01 06:00:00,1,0,0,1,9.02,13.635,80,0.0000,2,0,2
7,2011-01-01 07:00:00,1,0,0,1,8.20,12.880,86,0.0000,1,2,3

In [23]:
train.loc [1, "season"]

1

In [30]:
train.loc[1:7, ["holiday", "workingday"]]

   holiday  workingday
1        0           0
2        0           0
3        0           0
4        0           0
5        0           0
6        0           0
7        0           0

### 2-3. 색인

찾고자 하는 조건의 데이터 가져오기.
Pandas의 대괄호[] 안에 T/F로 이루어진 DataFrame과 길이가 같은 list를 넣어주면 True에 해당하는 행(row)만을 가져올 수 있다.